import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class QuizService {

  /** 勘定項目 */
  public accountItem = [
    [
      '借入金',
      '手形貸付金',
      '当座預金',
    ],
    [
      'クレジット売掛金',
      '支払手数料',
      '受取手数料',
      '売上',
    ],
    [
      '土地',
      '支払手数料',
      '受取手数料'
    ],
    [
      '仕入',
      '当座預金',
      '前払金',
      '仮払金',
      '立替金'
    ]
  ];

  /** 金額 */
  public money = [
    [
      '1,000',
      '1,000'
    ],
    [
      '200',
      '500',
      '4,500',
      '4,800',
      '5,000',
    ],
    [
      '500',
      '49,500',
      '50,000',
      '50,500',
      '50,500',
    ],
    [
      '80,000',
      '105,000',
      '25,000',
      '25,000'
    ]
  ];

  /** 借方 */
  public debit = [
    ['現金'],
    ['現金'],
    ['現金'],
    ['現金']
  ];

  /** 借方の金額 */
  public debitMoney = [
    ['1,000'],
    ['5,000'],
    ['5000,000'],
    ['80,000']
  ];

  /** 貸方 */
  public credit = [
    ['貸付金'],
    ['売上高'],
    ['売上高'],
    ['未払金']
  ];

  /** 貸方の金額 */
  public creditMoney = [
    ['1,000'],
    ['5,000'],
    ['5000,000'],
    ['105,000']
  ];

  constructor() { }

  public getProblemSentence():string[]{
    const name = window.sessionStorage.getItem('name')?.replace(/^"(.*)"$/, '$1');;
    return [
      `株式会社${name}は、銀行から現金1,000円を借入れた。仕訳で間違えている部分を修正したい。`,
      `株式会社${name}は、商品5,000円をクレジット払いの条件で販売した。なお、信販会社への手数料（販売代金の4％）は販売時に計上する。`,
      `${name}社は、土地50,000円を購入し、 代金は手数料500円とともに現金で支払った。`,
      `${name}社は、取引先に商品80,000円を注文し、手付金として25,000円の小切手を振り出して渡した。`
    ];
  }
}
